about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-12 Sat 15:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>about</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">about</h1>
<p>
after reading some of <a href="https://100r.co">100 rabbits</a>' work, i realized that i depend on
being always-online too much.
</p>

<p>
this was created to potentially replace my old <a href="https://wiki.owen.bellz.org">pmwiki wiki</a>. pmwiki
does not really have any good solutions for working offline, the
closest thing being <a href="https://www.pmwiki.org/wiki/Cookbook/WikiOnAStick">wiki on a stick</a>, which literally runs a webserver
with a LAMP stack from a non-portable<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> exe file. yuck.
</p>

<p>
i was also considering using <a href="https://vimwiki.github.io">vimwiki</a>, which has a more wiki-like
syntax, however that also makes the syntax less consistent and harder
to convert to/from. also configuring vimwiki is somewhat a nightmare
(perhaps ive been spoiled by lisp's customizability) and it seems a
bit overbearing about how it manages files.
</p>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> setupfile</h2>
<div class="outline-text-2" id="text-1">
<p>
the <a href="./setupfile.html">setupfile</a> is largely based on <a href="https://yeti.tilde.institure/brain/">yeti's brain's setupfile</a>. i know you
will probably never read this, but thank you for letting me use it :3
</p>
</div>
</div>

<div id="outline-container-org0000003" class="outline-2">
<h2 id="org0000003"><span class="section-number-2">2.</span> contributing</h2>
<div class="outline-text-2" id="text-2">
<p>
the git repository for this wiki is available in <a href="https://owen.bellz.org/git/orgwiki/">several</a> <a href="https://git.sr.ht/~xfnw/orgwiki">different</a>
<a href="https://github.com/xfnw/orgwiki">places</a>.
</p>

<p>
send a <a href="https://git-send-email.io">patch</a> to <code>xfnw ate riseup doot net</code> (replacing <code>ate</code> and <code>doot</code>
with the at and the full stop symbol respectively). hopefully i'll get
a mailinglist setup Soon&trade;.
</p>

<p>
if you do not want to send a patch, you can instead open a pull
request on <a href="https://github.com/xfnw/orgwiki/pulls">github</a>.
</p>
</div>

<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">2.1.</span> <span class="todo TODO">TODO</span> style guide</h3>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">2.2.</span> licensing</h3>
<div class="outline-text-3" id="text-2-2">
<p>
actual content is licensed under a <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/">CreativeCommons
Attribution-NonCommercial-ShareAlike 4.0 International</a> license.
</p>

<p>
additional content not subject to this license may be included in the
<code>media/</code> directory, on the condition that distribution with this wiki
falls under fair use. if you, in good faith, believe content you own
was included there not under fair use, please send an email to the
above address.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">non-portable as in being
difficult to run on other operating systems. in physical space, its
still very portable.</p></div></div>


</div>
</div></div>
</body>
</html>
